Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/accounts.po
Languages: es

source: The system will refer to the date of the last password change, if password is older than 6 months, the server will send an email to indicate that password has expired. In this case you need to change the user password. For example, if the last password change was made in January and the activation of the deadline in October, the system will assume the password changed in January is expired, and notify the user.
es: El sistema se referirá a la fecha del último cambio de contraseña, si la contraseña es mayor de 6 meses, el servidor enviará un correo electrónico para indicar que la contraseña ha caducado. En este caso, debe cambiar la contraseña de usuario. Por ejemplo, si el último cambio de contraseña se realizó en enero y la activación de la fecha límite en octubre, el sistema asumirá que la contraseña cambiada en enero expiró y notifica al usuario.

source: Effects of expired passwords
es: Efectos de contraseñas caducadas

source: After password expiration, the user is still able to read and send email messages.
es: Después de la expiración de la contraseña, el usuario sigue siendo capaz de leer y enviar mensajes de correo electrónico.

source: If |product| has an Active Directory account provider, the user cannot access shared folders, printers (by Samba) and other domain computers.
es: Si |product| tiene un proveedor de cuenta de Active Directory, el usuario no puede tener acceso a carpetas compartidas, impresoras (por Samba) y otros equipos de dominio.

source: Import users
es: Importar usuarios

source: It is possible to create user accounts from a TSV (Tab Separated Values) file with the following format: ::
es: Es posible crear cuentas de usuario desde un archivo TSV (Tab Separated Values, valores separados por tabulación) con el siguiente formato: ::

source: Example: ::
es: Ejemplo: ::

source: then execute: ::
es: Luego ejecutar: ::

source: For example, if the user’s file is /root/users.tsv, execute following command: ::
es: Por ejemplo, si el archivo del usuario es /root/users.tsv, ejecute el siguiente comando: ::

source: Alternative separator character: ::
es: Carácter de separador alternativo: ::

source: It is possible to create mail aliases from a TSV (Tab Separated Values) file with the following format: ::
es: Es posible crear alias de correo desde un archivo TSV (Tab Separated Values, valores separados por tabulación) con el siguiente formato: ::

source: Then you can use the ``import_emails`` script. See :ref:`import-users_section` for a sample script invocation.
es: A continuación, puede utilizar el script ``import_emails``. Ver :ref:`import-users_section` para una invocación del script de ejemplo.

source: Group management is available from the command line through ``group-create`` and ``group-modify`` events ::
es: La gestión de grupos está disponible desde la línea de comandos a través de los eventos ``group-create`` y ``group-modify`` ::
