Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/accounts.po
Languages: es

source: Users and groups
es: Usuarios y grupos

source: Account providers
es: Proveedores de cuentas

source: |product| supports authentication and authorization against either a **local** or **remote** account provider.
es: |product| soporta autenticación y autorización contra un proveedor de cuentas **local** o **remoto**

source: Supported provider types are:
es: Los tipos de proveedores compatibles son:

source: Local OpenLDAP running on |product| itself
es: OpenLDAP local corriendo en el propio |product|

source: Remote LDAP server with RFC2307 schema
es: Servidor LDAP remoto con esquema RFC2307

source: Local Samba 4 Active Directory Domain Controller
es: Controlador local de Active Directory de Samba 4

source: Remote Active Directory (both Microsoft and Samba)
es: Active Directory remoto (Microsoft y Samba)

source: The root user can configure any type of accounts provider from the :guilabel:`Accounts provider` page.
es: El usuario root puede configurar cualquier tipo de proveedor de cuentas desde la página :guilabel:`Accounts provider`.

source: Be aware of the following rule about account providers:
es: Tenga precaución con la siguiente regla sobre el proveedor de cuentas:

source: Once |product| has been bound to an account provider the FQDN cannot be changed any more
es: Una vez que |product| ha estado vinculado a un proveedor de cuentas, el FQDN no se puede cambiar más

source: Remote providers
es: Proveedores remotos

source: After |product| has been bound to a remote account provider the :guilabel:`User and groups` page shows the domain accounts in *read-only* mode.
es: Luego de que |product| ha sido unido a un proveedor de cuentas remoto la pagina de :guilabel:`Usuarios y grupos` muestra las cuentas del dominio en modo *solo-lectura*.

source: Local providers
es: Proveedores locales

source: After installing a local provider (either Samba 4 or OpenLDAP), the administrator can create, modify and delete the users and groups.
es: Después de instalar un proveedor local (ya sea Samba 4 o OpenLDAP), el administrador puede crear, modificar y eliminar los usuarios y grupos.

source: Please choose wisely your account provider because **the choice could not be reversible**. Also the system will forbid any change to the FQDN after the account provider has been configured.
es: Por favor, elige correctamente el proveedor de cuentas, ya que, ésa opción, podría ser irreversible. Además, el sistema podría rechazar cualquier cambio en el FQDN después de que el proveedor de cuentas se haya configurado.

source: Choosing the right account provider
es: Elegir el proveedor de cuenta correcto

source: Beside choosing to bind a remote provider or install a local one, the administrator has to decide which backend type suits his needs.
es: Aparate de elegir entre un proveedor de cuentas local o uno remoto, el administrador tiene que decidir qué tipo de backend necesita en base a sus necesidades.

source: The *File server* module of |product|, which enables the :guilabel:`Shared folders` page, can authenticate SMB/CIFS clients only if |product| is bound to an Active Directory domain. The LDAP providers allow access to :guilabel:`Shared folders` only in *guest mode*. See :ref:`shared_folders-section`.
es: El módulo *Servidor de archivos* de |product|, que habilita la página :guilabel:`Carpetas compartidas`, sólo puede autenticar clientes SMB/CIFS si |product| está enlazado a un dominio de Active Directory. Los proveedores LDAP permiten el acceso a :guilabel:`Carpetas compartidas` sólo en *modo invitado*. Véase: ref:`shared_folders-section`.

source: On the other hand, the local OpenLDAP provider is more easy to install and configure.
es: Por otro lado, el proveedor local de OpenLDAP es más fácil de instalar y configurar.

source: In the end, if the SMB file sharing protocol support is not required, an LDAP provider is the best choice.
es: Al final, si no se requiere el soporte para el protocolo de intercambio de archivos SMB, un proveedor LDAP es la mejor opción.

source: OpenLDAP local provider installation
es: Instalación del proveedor local de OpenLDAP

source: To install and configure an OpenLDAP local accounts provider, go to page :guilabel:`Accounts provider > LDAP > Install locally`. The system needs a working internet connection to download additional packages.
es: Para instalar y configurar un proveedor de cuentas local OpenLDAP, visita :guilabel:`Accounts provider > LDAP > Install locally`. El sistema necesita una conexión a Internet estable para descargar paquetes adicionales durante la instalación.

source: At the end of the installation the package is automatically configured and the administrator will be able to manage users and groups from the :guilabel:`User and groups` page.
es: Al finalizar la instalación, el paquete es configurado automáticamente y el administrador podrá administrar los :guilabel:`User and groups`.

source: See :ref:`admin-account-section` section for more details about default administrative user and group.
es: Consulta la sección :ref:`admin-account-section` para más detalles sobre los usuarios y grupos administrativos.

source: Samba Active Directory local provider installation
es: Instalación del proveedor local de Active Directory de Samba

source: When installing Samba Active Directory as local account provider, the system needs an **additional IP address** and a **working internet connection**.
es: Durante el proceso de instalación de Samba Active Directory como proveedor de cuentas local, el sistema necesitará un direccíon IP adicional y una conexión a Internet estable.

source: The additional IP is assigned to a Linux Container that runs the Active Directory Domain Controller roles and must be accessible from the LAN (green network).
es: El IP adicional se asigna a un contenedor Linux que ejecuta las funciones de controlador de dominio de Active Directory y debe ser accesible desde la LAN (red verde).

source: Therefore the additional IP address must satisfy three conditions:
es: Por lo tanto, la dirección IP adicional debe satisfacer tres condiciones:

source: the IP address has to be **free**; it must not be used by any other machine
es: La dirección IP tiene que ser **libre**; no debe ser utilizada por ninguna otra máquina

source: the IP address has to be in the same subnet range of a green network
es: La dirección IP debe estar en el mismo rango de subred de una red verde

source: the green network has to be bound to a bridge interface where the Linux Container can attach its virtual interface; the installation procedure can create the bridge interface automatically, if it is missing
es: La red verde debe ser montada sobre una interfaz puente donde un contenedor Linux puede unir la interfaz virtual. El proceso de instalación podría crear esa interfaz puente automáticamente si ésta no existe

source: To install a local Active Directory accounts provider, go to page :guilabel:`Accounts provider > Active Directory > Create a new domain`.
es: Para instalar un proveedor local de cuentas AD, ve a la página :guilabel:`Accounts provider > Active Directory > Create a new domain`.

source: The :guilabel:`DNS domain name` defines the DNS suffix of the new domain. |product| acts as an authoritative DNS server for that domain. See also :ref:`dns-and-ad-domain`.
es: El nombre :guilabel:`DNS domain name` define el sufijo DNS del nuevo dominio. |product| actúa como un servidor DNS autoritario de ese dominio. Ver también :ref:`dns-and-ad-domain`.

source: The Active Directory configuration procedure might require some time to run. It creates the Linux Container chroot, by downloading additional packages.
es: El procedimiento de configuración de Active Directory puede requerir algún tiempo para ejecutarse. Crea el chroot del Contenedor de Linux, descargando paquetes adicionales.

source: At the end of the Active Directory configuration procedure, the |product| host machine is automatically configured to join the Active Directory domain. Go to the page :guilabel:`User and groups` to see the default accounts.
es: Al final del procedimiento de configuración de Active Directory, el host |product| se configura automáticamente para unirse al dominio de Active Directory. Vaya a la página :guilabel:`Usuario y grupos` para ver las cuentas por defecto.

source: After installing Samba Active Directory, the :guilabel:`Users and groups` page has two default entries; both are disabled: :dfn:`administrator` and :dfn:`admin`. "Administrator" is the default Active Directory privileged account and is not required by |product|; it is safe to keep it disabled. "admin" is defined by |product| as the default system administrative account. It is member of the AD "domain admins" group. See :ref:`admin-account-section` section for more details.
es: Después de instalar Samba Active Directory, la página :guilabel:`Usuarios y grupos` tiene dos entradas predeterminadas; ambas están desactivadas: :dfn:`administrador` y :dfn:`admin`. "Administrador" es la cuenta privilegiada de Active Directory predeterminada y no es requerida por |product|; es seguro mantenerlo deshabilitado. "Admin" es definido por |product| como la cuenta administrativa predeterminada del sistema. Es miembro del grupo de administradores de dominio de AD. Véase la sección ref:`admin-account-section` para más detalles.

source: Installing on a virtual machine
es: Instalación en una máquina virtual

source: Samba Active Directory runs inside a Linux Container which uses a virtual network interface bridged to the network interface of the system. The virtual network interface has to be visible inside the physical network, but often virtualization solutions block ARP traffic. As a result, the Samba Active Directory container is not visible from LAN hosts.
es: Samba Active Directory se ejecuta dentro de un contenedor Linux que utiliza una interfaz de red virtual puenteada a la interfaz de red del sistema. La interfaz de red virtual debe ser visible dentro de la red física, pero a menudo las soluciones de virtualización bloquean el tráfico ARP. Como resultado, el contenedor de Active Directory de Samba no es visible desde hosts en LAN.

source: When installing on virtual environment, make sure the virtualization solution allows traffic in *promiscuous mode*.
es: Al instalar en un entorno virtual, asegúrese de que la solución de virtualización permite el tráfico en *modo promiscuo*.

source: To setup the promiscuous mode policy, select "Allow all" from the drop down list located in the network settings section.
es: Para configurar la política de modo promiscuo, seleccione "Permitir todo" en la lista desplegable ubicada en la sección de configuración de red.

source: Enter the networking configuration section of the virtualization mode and set the virtual switch in promiscuous mode.
es: Introduzca la sección de configuración de red del modo de virtualización y establezca el conmutador virtual en modo promiscuo.

source: Make sure the virtual machine is bridged to a real bridge (like br0) and the bridge is put in promiscuous mode.
es: Asegúrese de que la máquina virtual está conectada a un puente real (como br0) y el puente se pone en modo promiscuo.

source: It is possible to force a bridge (i.e. ``br0``) in promiscuous mode using this command: ::
es: Es posible forzar un puente (es decir ``br0``) en modo promiscuo usando este comando: ::

source: Join an existing Active Directory domain
es: Unirse a un dominio de Active Directory existente

source: Here |product| is bound to a remote Active Directory account provider. It can be provided by either Samba or Microsoft implementations. In this scenario |product| becomes a trusted server of an existing Active Directory domain. When accessing a |product| resource from a domain workstation, user credentials are checked against one of the domain controllers, and the access to the resource is granted.
es: Aquí |product| está enlazado a un proveedor de cuenta de Active Directory remoto. Puede ser proporcionado por implementaciones de Samba o Microsoft. En este escenario |product| se convierte en un servidor de confianza de un dominio de Active Directory existente. Al acceder a un recurso |product| de una estación de trabajo del dominio, las credenciales de usuario se comprueban contra uno de los controladores de dominio y se concede el acceso al recurso.

source: The Kerberos protocol requires the difference between systems clocks in the network is less than 5 minutes. Configure the network clients to align their clocks to a common time source. For |product| go to :guilabel:`Date and time` page.
es: El protocolo Kerberos requiere que la diferencia entre los relojes de los sistemas en la red sea inferior a 5 minutos. Configure los clientes de red para alinear sus relojes a una fuente de hora común. Para |product| Vaya a la página :guilabel:`Fecha y hora`.

source: Bind to a remote LDAP server
es: Vincular a un servidor LDAP remoto

source: Users
es: Usuarios

source: A newly created user account remains locked until it has set a password. Disabled users are denied to access system services.
es: Una nueva cuenta de usuario permanece bloqueada hasta que una contraseña ha sido configurada. Los usuarios deshabilitados tienen denegado el accesos a los servicios del sistema.

source: When creating a user, following fields are mandatory:
es: Cuando se crea un usuario, los siguientes campos son obligatorios.

source: User name
es: Nombre de usuario

source: Full name (name and surname)
es: Nombre completo (nombre y apellido)

source: A user can be added to one or more group from the :guilabel:`Users` page or from the :guilabel:`Groups` one.
es: Un usuario puede ser agregado a uno o mas grupos de la pagina :guilabel:`Usuarios` o de la pagina :guilabel:`Grupos` .

source: Sometimes you need to block user's access to services without deleting the account. This can be achieved using the :guilabel:`Lock` and :guilabel:`Unlock` actions.
es: Algunas veces ud. puede necesitar bloquear el acceso de un usuario a algún servicio, sin tener que borrar la cuenta. Esto se puede realizar usando las opciones :guilabel:`Bloquear` y :guilabel:`Desbloquear`

source: When a user is deleted, all user data will be also deleted.
es: Cuando se elimina un usuario, también se eliminarán todos los datos del usuario.

source: Changing the password
es: Cambio de la contraseña

source: If there wasn't given an initial password during user creation, the user account is disabled. To enable it, set a password using the :guilabel:`Change password` button.
es: Si no se configuro una contraseña inicial durante la creación del usuario, la cuenta del usuario es deshabilitada. Para habilitarla, configure una contraseña utilizando el botón :guilabel:`Cambiar contraseña`.

source: When a user is enabled, the user can access the Server Manager and change his/her own password by going to the :guilabel:`user@domain.com` label on the upper right corner of the screen and clicking on :guilabel:`Profile`.
es: Cuando un usuario es habilitado, el usuario puede acceder a la administración del servidor para cambiar su propia contraseña yendo a la etiqueta :guilabel:`user@domain.com` en la esquina superior derecha de la pantalla y cliqueando en :guilabel:`Perfil`.

source: If the system is bound to an Active Directory account provider, users can change their password also using the Windows tools. In this case you can not set passwords shorter than 6 *characters* regardless of the server policies. Windows performs preliminary checks and sends the password to the server where it is evaluated according to the :ref:`configured policies <password-management-section>`.
es: Si el sistema esta unido a un proveedor de cuentas de Active Directory, los usuario pueden cambiar su contraseña usando las herramientas de Windows. En este caso ud. no puede configurar contraseñas de menos de 6 *caracteres* sin importar las políticas del servidor. Los chequeos preliminares de windows envían la contraseña al servidor donde son evaluados de acuerdo a :ref:`políticas configuradas <password-management-section>`.

source: Credentials for services
es: Credenciales de servicios

source: The user's credentials are the **user name** and his **password**. Credentials are required to access the services installed on the system.
es: Las credenciales de usuario son **usuario** y su **contraseña**. Las credenciales son requeridas para acceder a los servicios instalados en el sistema.

source: The user name can be issued in two forms: *long* (default) and *short*. The *long* form is always accepted by services. It depends on the service to accept also the *short* form.
es: El nombre de usuario se puede emitir en dos formas: *largo* (predeterminado) y *corto*. El formulario *largo* siempre es aceptado por los servicios. Depende del servicio aceptar también el formulario *corto*.

source: For instance if the domain is *example.com* and the user is *goofy*:
es: Por ejemplo si el dominio es *example.com* y el usuario es *goofy*:

source: To access a shared folder, see also :ref:`smb-access-section`.
es: Para acceder a una carpeta compartida, vea también :ref:`smb-access-section`.

source: Groups
es: Grupos

source: A group of users can be granted some permission, such as authorize access over a :ref:`shared folder <shared_folders-section>`. The granted permission is propagated to all group members.
es: A un grupo de usuarios se le puede conceder algún permiso, como autorizar el acceso a través de :ref:`Carpetas compartidas <shared_folders-section>`. El permiso concedido se propaga a todos los miembros del grupo.

source: Two special groups can be created. Members of these groups are granted access to the panels of the Server Manager:
es: Se pueden crear dos grupos especiales. Los miembros de estos grupos tienen acceso a los paneles del Administrador de servidores:

source: :dfn:`domain admins`: members of this group have the same permissions as the *root* user from the Server Manager.
es: :dfn:`administradores de dominio`: los miembros de este grupo tienen los mismos permisos que el usuario *root* del Administrador de servidores.

source: :dfn:`managers`: members of this group are granted access to the *Management* section of the Server Manager.
es: :dfn:`managers`: los miembros de este grupo tienen acceso a la sección *Administración* del Administrador de servidores.

source: Admin account
es: Cuenta de administrador

source: If a **local AD or LDAP provider** is installed, an *admin* user, member of the *domain admins* group is created automatically. This account allows access to all configuration pages within the Server Manager. It is initially *disabled* and has no access from the console.
es: Si se instala un **proveedor local de AD o LDAP**, se crea automáticamente un usuario *admin*, miembro del grupo *administradores* del dominio. Esta cuenta permite acceder a todas las páginas de configuración dentro del Administrador del servidor. El acceso está inicialmente *deshabilitado* y no tiene acceso desde la consola.

source: To enable the *admin* account set its password.
es: Para habilitar la cuenta *admin*, establezca su contraseña.

source: Where applicable, the *admin* account is granted special privileges on some specific services, such as joining a workstation to an Active Directory domain.
es: Cuando se aplica, la cuenta *admin* tiene privilegios especiales en algunos servicios específicos, como unirse a una estación de trabajo a un dominio de Active Directory.

source: If |product| is bound to a **remote account provider**, the *admin* user and *domain admins* group could be created manually, if they do not already exist.
es: La gestión de grupos está disponible desde la línea de comandos a través de los eventos ``group-create`` y ``group-modify`` ::

source: If a user or group with a similar purpose is already present in the remote account provider database, but it is named differently, |product| can be configured to rely on it with the following commands: ::
es: Si un usuario o grupo con un propósito similar ya está presente en la base de datos del proveedor de cuentas remotas, pero se denomina de forma diferente, |product| puede ser configurado para confiar en él con los siguientes comandos: ::

source: Password management
es: Gestión de contraseñas

source: The system provides the ability to set constraints on password :dfn:`complexity` and :dfn:`expiration`.
es: El sistema proporciona la capacidad de establecer restricciones en la contraseña :dfn:`complejidad` y :dfn:`expiración`.

source: Password policies can be changed from web interface.
es: Las directivas de contraseñas se pueden cambiar desde la interfaz web.

source: Complexity
es: Complejidad

source: The :index:`password` complexity is a set of minimum conditions for password to be accepted by the system: You can choose between two different management policies about password complexity:
es: La complejidad de la :index:`contraseña` es un conjunto de condiciones mínimas para que la misma sea aceptada por el sistema: Puede elegir entre dos políticas de administración diferentes sobre la complejidad de la contraseña:

source: :dfn:`none`: there is no specific control over the password entered, but minimum length is 7 characters
es: :dfn:`none`: no hay control específico sobre la contraseña introducida, pero la longitud mínima es de 7 caracteres

source: The :index:`strong` policy requires that the password must comply with the following rules:
es: La directiva :index:`strong` requiere que la contraseña cumpla con las siguientes reglas:

source: Minimum length of 7 characters
es: Longitud mínima de 7 caracteres

source: Contain at least 1 number
es: Contiene al menos 1 número

source: Contain at least 1 uppercase character
es: Contiene al menos 1 carácter en mayúscula

source: Contain at least 1 lowercase character
es: Contiene al menos 1 carácter minúscula

source: Contain at least 1 special character
es: Contiene al menos 1 carácter especial

source: At least 5 different characters
es: Al menos 5 caracteres diferentes

source: Must be not present in the dictionaries of common words
es: No debe estar presente en los diccionarios de palabras comunes

source: Must be different from the username
es: Debe ser diferente del nombre de usuario

source: Can not have repetitions of patterns formed by 3 or more characters (for example the password As1.$ AS1. $ is invalid)
es: No se pueden realizar repeticiones de patrones formados por 3 o más caracteres (por ejemplo, la contraseña As1.$ AS1. $ No es válida)

source: If Samba Active Directory is installed, also the system will enable password history
es: Si se instala Samba Active Directory, también el sistema habilitará el historial de contraseñas

source: The default policy is :dfn:`strong`.
es: La directiva predeterminada es: dfn:`strong`.

source: Changing the default policies is highly discouraged. The use of weak passwords often lead to compromised servers by external attackers.
es: El cambio de las políticas predeterminadas es contraindicado. El uso de contraseñas débiles a menudo conduce a servidores comprometidos por atacantes externos.

source: Expiration
es: Vencimiento

source: The :index:`password expiration` is enabled by default to 6 months from the time when the password is set. The system will send an e-mail to inform the users when their password is about to expire.
es: La :index:`Caducidad de contraseña` está habilitada de forma predeterminada a 6 meses desde el momento en que se establece la contraseña. El sistema enviará un correo electrónico para informar a los usuarios cuando su contraseña está a punto de expirar.
