Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/firewall.po
Languages: es

source: Firewall and gateway
es: Firewall y gateway / Cortafuego y Puerta de enlace

source: |product| can act as :index:`firewall` and :index:`gateway` inside the network where is installed. All traffic between computers on the local network and the Internet passes through the server that decides how to route packets and what rules to apply.
es: |product| Puede actuar como: index:`cortafuego` y :index:`puerta de enlace` dentro de la red donde está instalado. Todo el tráfico entre computadoras de la red local e Internet pasa a través del servidor que decide cómo enrutar paquetes y qué reglas aplicar.

source: Main features:
es: Principales características:

source: Advanced network configuration (bridge, bonds, alias, etc)
es: Configuración de red avanzada (puente, enlaces, alias, etc.)

source: Multi WAN support (up to 15)
es: Soporte multi WAN (hasta 15)

source: Firewall rules management
es: Gestión de reglas de firewall

source: Traffic shaping (QoS)
es: Conformación del tráfico (QoS)

source: Port forwarding
es: Reenvío de puertos

source: Routing rules to divert traffic on a specific WAN
es: Reglas de enrutamiento para desviar tráfico en una WAN específica

source: Intrusion Prevention System (IPS)
es: Sistema de prevención de intrusiones (IPS, Intrusion Prevention System)

source: Deep packet inspection (DPI)
es: Inspección profunda de paquetes (DPI, Deep Packet Inspection)

source: Firewall and gateway modes are enabled only if:
es: Los modos de firewall y gateway sólo están habilitados si:

source: the `nethserver-firewall-base` package is installed
es: El paquete `nethserver-firewall-base` está instalado

source: at least there is one network interface configured with red role
es: Al menos hay una interfaz de red configurada con rol rojo

source: Policy
es: Política

source: Each interface is identified with a color indicating its role within the system. See :ref:`network-section`.
es: Cada interfaz se identifica con un color que indica su función dentro del sistema. Véase :ref:`red-sección`.

source: When a network packet passes through a firewall zone, the system evaluates a list of rules to decide whether traffic should be blocked or allowed. :dfn:`Policies` are the default rules to be applied when the network traffic does not match any existing criteria.
es: Cuando un paquete de red pasa a través de una zona de cortafuegos, el sistema evalúa una lista de reglas para decidir si el tráfico debe ser bloqueado o permitido. :dfn:`Políticas` son las reglas predeterminadas que se aplicarán cuando el tráfico de red no coincide con los criterios existentes.

source: The firewall implements two default policies editable from the page :menuselection:`Firewall rules` -> :guilabel:`Configure`:
es: El cortafuego implementa dos políticas predeterminadas editables desde la página :menuselection:`Reglas de firewall` -> :guilabel:` Configurar`:

source: :dfn:`Allowed`: all traffic from green to red is allowed
es: :dfn: `Permitido`: se permite todo el tráfico de verde a rojo

source: :dfn:`Blocked`: all traffic from green to red network is blocked. Specific traffic must be allowed with custom rules.
es: :dfn:`Bloqueado`: todo el tráfico de la red verde a la red roja está bloqueado. Se debe permitir tráfico específico con reglas personalizadas.

source: Firewall :index:`policies` allow inter-zone traffic accordingly to this schema: ::
es: Las :index:`políticas` de firewall permiten el tráfico entre zonas según este esquema: ::

source: Traffic is allowed from left to right, blocked from right to left.
es: El tráfico se permite de izquierda a derecha, bloqueado de derecha a izquierda.

source: You can create rules between zones to change default policies from :guilabel:`Firewall rules` page.
es: Puede crear reglas entre zonas para cambiar las políticas predeterminadas de la página :guilabel:`Reglas de firewall`.

source: Traffic from local network to the server on SSH port (default 22) and Server Manager port (default 980) is **always** permitted.
es: El tráfico desde la red local al servidor en el puerto SSH (predeterminado 22) y el puerto del Administrador del servidor (predeterminado 980) es **siempre** permitido.

source: Rules
es: Reglas

source: :index:`Rules` apply to all traffic passing through the firewall. When a network packet moves from one zone to another, the system looks among configured rules. If the packet match a rule, the rule is applied.
es: Las :index:`Reglas` se aplican a todo el tráfico que pasa a través del cortafuego. Cuando un paquete de red se desplaza de una zona a otra, el sistema busca entre las reglas configuradas. Si el paquete coincide con una regla, se aplica la regla.

source: Rule's order is very important. The system always applies the first rule that matches.
es: El orden de la regla es muy importante. El sistema siempre aplica la primera regla que coincide.

source: A rule consists of four main parts:
es: Una regla consta de cuatro partes principales:

source: Action
es: Acción

source: Source
es: Fuente

source: Destination
es: Destino

source: Service
es: Servicio

source: Time condition
es: Condición de tiempo

source: Available actions are:
es: Las acciones disponibles son:

source: :dfn:`ACCEPT`: accept the network traffic
es: :dfn:`ACCEPT`: acepta el tráfico de red

source: :dfn:`REJECT`: block the traffic and notify the sender host
es: :dfn:`REJECT`: bloquea el tráfico y notifica al host remitente

source: :dfn:`DROP`: block the traffic, packets are dropped and no notification is sent to the sender host
es: :dfn:`DROP`: bloquea el tráfico, los paquetes se eliminan y no se envía ninguna notificación al host del remitente

source: :dfn:`ROUTE`: route the traffic to the specified WAN provider. See :ref:`multi-wan-section`.
es: :dfn:`ROUTE`: enruta el tráfico al proveedor de WAN especificado. Véase :ref:`multi-wan-section`.

source: :dfn:`Hi-Prio`: mark the traffic as high priority. See :ref:`traffic-shaping-section`.
es: :dfn:`Hi-Prio`: marca el tráfico como prioridad alta. Véase :ref:`traffic-shaping-section`.

source: :dfn:`Low-Prio`: mark the traffic as low priority. See :ref:`traffic-shaping-section`.
es: :dfn:`Low-Prio`: marca el tráfico como prioridad baja. Véase :ref:`traffic-shaping-section`.

source: The firewall will not generate rules for blue and orange zones, if at least a red interface is configured.
es: El cortafuego no generará reglas para las zonas azul y naranja, si al menos una interfaz roja está configurada.

source: As a general rule, you should use :index:`REJECT` when you want to inform the source host that the port to which it is trying to access is closed. Usually the rules on the LAN side can use REJECT.
es: Como regla general, debe utilizar: index: `REJECT` cuando desea informar al host de origen de que el puerto al que está intentando acceder está cerrado. Por lo general, las reglas en el lado de LAN pueden usar REJECT.

source: For connections from the Internet, it is recommended to use :index:`DROP`, in order to minimize the information disclosure to any attackers.
es: Para conexiones desde Internet, se recomienda utilizar: index:`DROP`, con el fin de minimizar la divulgación de información a cualquier atacante.

source: Log
es: Registro

source: When a rule matches the ongoing traffic, it's possible to register the event on a log file by checking the option from the web interface. :index:`Firewall log` is saved in :file:`/var/log/firewall.log` file.
es: Cuando una regla coincide con el tráfico en curso, es posible registrar el evento en un archivo de registro marcando la opción de la interfaz web. El :index:`registro de firewall` se guarda en :file:`/var/log/firewall.log`.

source: Deep Packet Inspection (DPI)
es: Inspección profunda de paquetes (DPI, Deep Packet Inspection)

source: The Deep Packet Inspection (DPI) [#DPI]_ is an advanced packet filtering technique.
es: La Deep Packet Inspection (DPI) [#DPI] _ es una avanzada técnica de filtrado de paquetes.

source: When the DPI module is active, new items for the :guilabel:`Service` field are available in the :guilabel:`Edit rule` form. Those items are labeled *DPI protocol*, among the usual *network service* and *service object* items.
es: Cuando el módulo DPI está activo, los nuevos elementos del campo :guilabel:`Servicio` están disponibles en el formulario :guilabel:`Editar regla`. Estos elementos están etiquetados como *protocolo DPI*, entre los elementos habituales de *servicio de red* y *objeto de servicio*.

source: The complete list of available DPI protocols can be obtained from the Dashboard or with the following command: ::
es: La lista completa de los protocolos DPI disponibles se puede obtener desde el Dashboard o con el siguiente comando: ::

source: Deep Packet Inspection https://en.wikipedia.org/wiki/Deep_packet_inspection
es: Inspección profunda de paquete, Deep Packet Inspection https://es.wikipedia.org/wiki/Inspección_profunda_de_paquete

source: Examples
es: Ejemplos

source: Below there are some examples of rules.
es: A continuación hay algunos ejemplos de reglas.

source: Block all DNS traffic from the LAN to the Internet:
es: Bloquear todo el tráfico de DNS de la LAN a Internet:

source: Action: REJECT
es: Acción: REJECT

source: Source: green
es: Fuente: verde

source: Destination: red
es: Destino: rojo

source: Service: DNS (UDP port 53)
es: Servicio: DNS (puerto UDP 53)

source: Allow guest's network to access all the services listening on Server1:
es: Permitir que la red de invitados tenga acceso a todos los servicios que escuchan en Servidor1

source: Action: ACCEPT
es: Acción: ACCEPT

source: Source: blue
es: Fuente: azul

source: Destination: Server1
es: Destino: Servidor1

source: Service: -
es: Servicio: -

source: The term :dfn:`WAN` (Wide Area Network) refers to a public network outside the server, usually connected to the Internet. A :dfn:`provider` is the company who actually manage the :index:`WAN` link.
es: El término :dfn:`WAN` (Wide Area Network) se refiere a una red pública fuera del servidor, generalmente conectada a Internet. Un :dfn:`proveedor` es la empresa que realmente gestiona el enlace :index:`WAN`.

source: The system supports up to 15 WAN connections. If the server has two or more configured red cards, it is required to correctly fill :guilabel:`Link weight`, :guilabel:`Inbound bandwidth` and :guilabel:`Outbound bandwidth` fields from the :guilabel:`Network` page.
es: El sistema admite hasta 15 conexiones WAN. Si el servidor tiene dos o más tarjetas rojas configuradas, es necesario rellenar correctamente los campos :guilabel:`Enlace ponderado`, :guilabel:`Ancho de banda entrante` y :guilabel: `Ancho de banda saliente` desde la página :guilabel:`Red` .

source: Each provider represents a WAN connection and is associated with a network adapter. Each provider defines a :dfn:`weight`: higher the :index:`weight`, higher the priority of the network card associated with the provider.
es: Cada proveedor representa una conexión WAN y está asociado con un adaptador de red. Cada proveedor define un :dfn:`peso`: mientras mayor es el :index:`peso`, mayor es la prioridad de la tarjeta de red asociada con el proveedor.

source: The system can use WAN connections in two modes (button :guilabel:`Configure` on page :menuselection:`Multi WAN`):
es: El sistema puede utilizar conexiones WAN en dos modos (botón :guilabel:`Configurar` en la página :menuselection:`Multi WAN`):

source: :dfn:`Balance`: all providers are used simultaneously according to their weight
es: :dfn:`Balance`: todos los proveedores se utilizan simultáneamente según su peso

source: :dfn:`Active backup`: providers are used one at a fly from the one with the highest weight. If the provider you are using loses its connection, all traffic will be diverted to the next provider.
es: :dfn:`Activar copia de seguridad`: los proveedores se utilizan uno a uno al vuelo con el que tiene el peso más alto. Si el proveedor que está utilizando pierde su conexión, todo el tráfico se desviará al proveedor siguiente.

source: To determine the status of a provider, the system sends an ICMP packet (ping) at regular intervals. If the number of dropped packets exceeds a certain threshold, the provider is disabled.
es: Para determinar el estado de un proveedor, el sistema envía un paquete ICMP (ping) a intervalos regulares. Si el número de paquetes perdidos excede un determinado umbral, el proveedor está deshabilitado.

source: The administrator can configure the sensitivity of the monitoring through the following parameters:
es: El administrador puede configurar la sensibilidad de la supervisión mediante los siguientes parámetros:

source: Percentage of lost packets
es: Porcentaje de paquetes perdidos

source: Number of consecutive lost packets
es: Número de paquetes perdidos consecutivos

source: Interval in seconds between sent packets
es: Intervalo en segundos entre paquetes enviados

source: The :guilabel:`Firewall rules` page allows to route network packets to a given WAN provider, if some criteria are met. See :ref:`firewall-rules-section`.
es: La página :guilabel:`Reglas de firewall` permite enrutar paquetes de red a un proveedor de WAN determinado, si se cumplen algunos criterios. Véase :ref:`firewall-rules-section`.

source: Example
es: Ejemplo

source: Given two configured providers:
es: Dados dos proveedores configurados:

source: Provider1: network interface eth1, weight 100
es: Proveedor1: interfaz de red eth1, peso 100

source: Provider2: network interface eth0, weight 50
es: Proveedor2: interfaz de red eth0, peso 50

source: If balanced mode is selected, the server will route a double number of connections on Provider1 over Provider2.
es: Si se selecciona el modo equilibrado, el servidor encaminará un número doble de conexiones en Proveedor1 sobre Proveedor2.

source: If active backup mode is selected, the server will route all connections on Provider1; only if Provider1 becomes unavailable the connections will be redirected to Provider2.
es: Si se selecciona el modo de copia de seguridad activa, el servidor enrutará todas las conexiones en Proveedor1; Sólo si Proveedor1 se vuelve inasequible las conexiones se redirigirán a Proveedor2.

source: Port forward
es: Reenviar puerto

source: The firewall blocks requests from public networks to private ones. For example, if web server is running inside the LAN, only computers on the local network can access the service on the green zone. Any request made by a user outside the local network is blocked.
es: El cortafuego bloquea las solicitudes de las redes públicas a las privadas. Por ejemplo, si el servidor web se ejecuta dentro de la LAN, sólo los equipos de la red local pueden acceder al servicio en la zona verde. Cualquier solicitud hecha por un usuario fuera de la red local está bloqueada.

source: To allow any external user access to the web server you must create a :dfn:`port forward`. A :index:`port forward` is a rule that allows limited access to resources from outside of the LAN.
es: Para permitir que cualquier usuario externo acceda al servidor web, debe crear una :dfn:`remisión de puerto`. Una :index:`remisión de puerto` es una regla que permite un acceso limitado a los recursos desde fuera de la LAN.

source: When you configure the server, you must choose the listening ports. The traffic from red interfaces will be redirected to selected ports. In the case of a web server, listening ports are usually port 80 (HTTP) and 443 (HTTPS).
es: Al configurar el servidor, debe elegir los puertos de escucha. El tráfico de las interfaces rojas se redireccionará a los puertos seleccionados. En el caso de un servidor web, los puertos de escucha son generalmente el puerto 80 (HTTP) y 443 (HTTPS).

source: When you create a port forward, you must specify at least the following parameters:
es: Cuando cree un puerto hacia adelante, debe especificar al menos los siguientes parámetros:

source: The source port
es: El puerto fuente

source: The destination port, which can be different from the origin port
es: El puerto de destino, que puede ser diferente del puerto de origen

source: The address of the internal host to which the traffic should be redirected
es: La dirección del host interno al que se debe redirigir el tráfico

source: It's possibile to specify a port range using a colon as separator in the source port field (eX: 1000:2000), in this case the field destination port must be left void
es: Es posible especificar un rango de puertos usando dos puntos como separador en el campo de puerto de origen (eX: 1000: 2000), en este caso el puerto de destino de campo se debe dejar vacío

source: Given the following scenario:
es: Dado el siguiente escenario:

source: Internal server with IP 192.168.1.10, named Server1
es: Servidor interno con IP 192.168.1.10, denominado Servidor1

source: Web server listening on port 80 on Server1
es: Servidor Web escuchando en el puerto 80 en Servidor1

source: SSH server listening on port 22 on Server1
es: Servidor SSH escuchando en el puerto 22 en Servidor1

source: Other services in the port range beetween 5000 and 6000 on Server1
es: Otros servicios en el rango de puerto entre 5000 y 6000 en Servidor1

source: If you want to make the web server available directly from public networks, you must create a rule like this:
es: Si desea que el servidor web esté disponible directamente desde redes públicas, debe crear una regla como esta:

source: origin port: 80
es: puerto de origen: 80

source: destination port: 80
es: puerto de destino: 80

source: host address: 192.168.1.10
es: Dirección del host: 192.168.1.10

source: All incoming traffic on firewall's red interfaces on port 80, will be redirected to port 80 on Server1.
es: Todo el tráfico entrante en las interfaces rojas del firewall en el puerto 80, será redirigido al puerto 80 en Servidor1.

source: In case you want to make accessible from outside the SSH server on port 2222, you will have to create a port forward like this:
es: En caso de que quiera hacer accesible desde fuera del servidor SSH en el puerto 2222, tendrá que crear un puerto hacia adelante de esta manera:

source: origin port: 2222
es: puerto de origen: 2222

source: destination port: 22
es: puerto de destino: 22

source: All incoming traffic on firewall's red interfaces on port 2222, will be redirected to port 22 on Server1.
es: Todo el tráfico entrante en las interfaces rojas del firewall en el puerto 2222, será redirigido al puerto 22 en Servidor1.

source: In case you want to make accessible from outside the server on the whole port range beetween 5000 and 6000, you will have to create a port forward like this:
es: En caso de que quiera hacer accesible desde fuera del servidor en toda la gama de puertos entre 5000 y 6000, tendrá que crear un puerto como este:

source: origin port: 5000:6000
es: Puerto de origen: 5000:6000

source: destination port:
es: puerto de destino:

source: All incoming traffic on firewall's red interfaces on port range beetween 5000 and 6000 will be redirected to same ports on Server1.
es: Todo el tráfico entrante en las interfaces de firewall rojo en el rango de puerto entre 5000 y 6000 será redirigido a los mismos puertos en Servidor1.

source: Limiting access
es: Limitar el acceso

source: You can restrict access to port forward only from some IP address or networks using the field :guilabel:`Allow only from`.
es: Puede restringir el acceso al puerto sólo desde algunas direcciones IP o redes utilizando el campo :guilabel:`Permitir sólo de`.

source: This configuration is useful when services should be available only from trusted IP or networks. Some possible values:
es: Esta configuración es útil cuando los servicios deben estar disponibles sólo de IP o redes de confianza. Algunos valores posibles:

source: ``10.2.10.4``: enable port forward for traffic coming from 10.2.10.4 IP
es: ``10.2.10.4``: habilitar el puerto hacia adelante para el tráfico procedente de la IP 10.2.10.4

source: ``10.2.10.4,10.2.10.5``: enable port forward for traffic coming from 10.2.10.4 and 10.2.10.5 IPs
es: ``10.2.10.4,10.2.10.5``: habilitar el puerto hacia adelante para el tráfico procedente de las IPs 10.2.10.4 y 10.2.10.5

source: ``10.2.10.0/24``: enable port forward only for traffic coming from 10.2.10.0/24 network
es: ``10.2.10.0/24``: habilita el reenvío del puerto sólo para el tráfico procedente de la red 10.2.10.0/24

source: ``!10.2.10.4``: enable port forward for all IPs except 10.2.10.4
es: ``!10.2.10.4``: habilita el reenvío de puertos para todas las IP excepto 10.2.10.4

source: ``192.168.1.0/24!192.168.1.3,192.168.1.9``: enable port forward for 192.168.1.0/24 network, except for hosts 192.168.1.3 and 192.168.1.9
es: ``192.168.1.0/24!192.168.1.3,192.168.1.9``: habilita el reenvío de puertos para la red 192.168.1.0/24, excepto los hosts 192.168.1.3 y 192.168.1.9

source: One-to-one NAT is a way to make systems behind a firewall and configured with private IP addresses appear to have public IP addresses.
es: NAT uno a uno es una forma de hacer que los sistemas detrás de un cortafuegos y configurado con direcciones IP privadas parecieran tener direcciones IP públicas.

source: If you have a bunch of public IP addresses and if you want to associate one of these to a specific network host, :index:`NAT 1:1` is the way.
es: Si tiene un montón de direcciones IP públicas y si desea asociar una de ellas a un host de red específico, :index:`NAT 1:1` es el camino.

source: In our network we have an host called ``example_host`` with IP ``192.168.5.122``. We have also associated a public IP address ``89.95.145.226`` as an alias of ``eth0`` interface (``RED``).
es: En nuestra red tenemos un host llamado ``example_host`` con IP ``192.168.5.122``. También hemos asociado una dirección IP pública ``89.95.145.226`` como un alias de la interfaz ``eth0`` (``ROJA``).

source: We want to map our internal host (``example_host`` - ``192.168.5.122``) with public IP ``89.95.145.226``.
es: Queremos mapear nuestro host interno (``example_host`` - ``192.168.5.122``) con IP pública ``89.95.145.226``.

source: In the :guilabel:`NAT 1:1` panel, we choose for the IP ``89.95.145.226`` (read-only field) the specific host (``example_host``) from the combo-box. We have configured correctly the one-to-one NAT for our host.
es: En el panel :guilabel:`NAT 1:1`, elegimos para el IP``89.95.145.226`` (campo de sólo lectura) el host específico (``example_host``) del cuadro combinado. Hemos configurado correctamente el NAT de uno a uno para nuestro host.

source: Traffic shaping
es: Conformación del tráfico

source: :index:`Traffic shaping` allows to apply priority rules on network traffic through the firewall. In this way it is possible to optimize the transmission, check the latency and tune the available bandwidth.
es: La :index:`Modulación del tráfico` permite aplicar reglas de prioridad sobre el tráfico de red a través del cortafuego. De esta forma es posible optimizar la transmisión, comprobar la latencia y afinar el ancho de banda disponible.

source: To enable traffic shaping it is necessary to know the amount of available bandwidth in both directions and fill in the fields indicating the speed of the Internet link. Be aware that in case of congestion by the provider there is nothing to do in order to improve performance.
es: Para habilitar la modulación del tráfico es necesario conocer la cantidad de ancho de banda disponible en ambas direcciones y rellenar los campos que indican la velocidad del enlace de Internet. Tenga en cuenta que en caso de congestión por el proveedor no hay nada que hacer para mejorar el rendimiento.
