Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/firewall.po
Languages: es

source: Traffic shaping rules can be configured from the :menuselection:`Firewall rules` page, while the available bandwidth can be set from the :menuselection:`Network` page for all red interfaces.
es: Las reglas de modulación del tráfico se pueden configurar desde la página :menuselection:`Reglas firewall`, mientras que el ancho de banda disponible se puede establecer desde la página :menuselection:`Red` para todas las interfaces rojas.

source: The system provides two levels of priority, high and low: as default all traffic has medium priority. It is possible to assign high or low priority to certain services based on the port used (eg low traffic peer to peer).
es: El sistema proporciona dos niveles de prioridad, alto y bajo: por defecto todo el tráfico tiene prioridad media. Es posible asignar alta o baja prioridad a ciertos servicios basados en el puerto utilizado (por ejemplo, peer to peer de bajo tráfico).

source: The system works even without specifying services to high or low priority, because, by default, the interactive traffic is automatically run at high priority (which means, for example, it is not necessary to specify ports for VoIP traffic or SSH). Also ICMP ping traffic is guaranteed high priority.
es: El sistema funciona incluso sin especificar servicios con prioridad alta o baja, ya que, de forma predeterminada, el tráfico interactivo se ejecuta automáticamente con alta prioridad (lo que significa, por ejemplo, que no es necesario especificar puertos para tráfico VoIP o SSH). También se garantiza alta prioridad el tráfico de ping ICMP.

source: Be sure to specify an accurate estimate of the bandwidth on network interfaces. To pick an appropriate setting, please do not trust the nominal value, but use the online tools to test the real provider speed.
es: Asegúrese de especificar una estimación precisa del ancho de banda en las interfaces de red. Para elegir un ajuste apropiado, no confíe en el valor nominal, pero utilice las herramientas en línea para probar la velocidad real del proveedor.

source: Firewall objects
es: Objetos del cortafuego

source: :index:`Firewall objects` are representations of network components and are useful to simplify the creation of rules.
es: Los :index:`Objetos del cortafuego` son representaciones de componentes de red y son útiles para simplificar la creación de reglas.

source: There are 6 types of objects, 5 of them represent sources and destinations:
es: Hay 6 tipos de objetos, 5 de ellos representan fuentes y destinos:

source: Host: representing local and remote computers. Example: web_server, pc_boss
es: Host: representa los ordenadores locales y remotos. Ejemplo: web_server, pc_boss

source: Groups of hosts: representing homogeneous groups of computers. Hosts in a host group should always be reachable using the same interface. Example: servers, pc_segreteria
es: Grupos de hosts: representación de grupos homogéneos de ordenadores. Los hosts de un grupo siempre deben ser accesibles utilizando la misma interfaz. Ejemplo: servidores, pc_secretaria

source: CIDR Networks: You can express a CIDR network in order to simplify firewall rules.
es: Redes CIDR: Puede expresar una red CIDR para simplificar las reglas del firewall.

source: Example 1 : last 14 IP address of the network are assigned to servers (192.168.0.240/28).
es: Ejemplo 1 : los últimos 14 direcciones IP de la red se asignan a servidores (192.168.0.240/28).

source: Example 2 : you have multiple green interfaces but you want to create firewall rules only for one green (192.168.2.0/24).
es: Ejemplo 2 : tiene varias interfaces verdes pero desea crear reglas de firewall sólo para una verde (192.168.2.0/24).

source: *Zone*: representing networks of hosts, they must be expressed in CIDR notation. Their usage is for defining a part of a network with different firewall rules from those of the nominal interface. They are used for very specific needs.
es: *Zona*: representa redes de hosts, deben expresarse en notación CIDR. Su uso es para definir una parte de una red con diferentes reglas de firewall de las de la interfaz nominal. Se utilizan para necesidades muy específicas.

source: By default, all hosts belonging to a zone are not allowed to do any type of traffic. It's necessary to create all the rules on the firewall in order to obtain the desired behavior.
es: De forma predeterminada, todos los hosts pertenecientes a una zona no pueden realizar ningún tipo de tráfico. Es necesario crear todas las reglas en el cortafuegos para obtener el comportamiento deseado.

source: Time conditions: can be associated to firewall rules to limit their effectiveness to a given period of time.
es: Condiciones de tiempo: se pueden asociar a las reglas de firewall para limitar su eficacia a un período de tiempo determinado.

source: The last type of object is used to specify the type of traffic:
es: El último tipo de objeto se utiliza para especificar el tipo de tráfico:

source: Services: a service listening on a host with at least one port and protocol. Example: ssh, https
es: Servicios: un servicio de escucha en un host con al menos un puerto y protocolo. Ejemplo: ssh, https

source: When creating rules, you can use the records defined in :ref:`dns-section` and :ref:`dhcp-section` like host objects. In addition, each network interface with an associated role is automatically listed among the available zones.
es: Al crear reglas, puede utilizar los registros definidos en :ref:`dns-section` y :ref:`dhcp-section` como objetos host. Además, cada interfaz de red con un rol asociado se lista automáticamente entre las zonas disponibles.

source: Rules which have time conditions are enforced only for new connections. Example: if you are blocking HTTP connections from 09:00 to 18:00, connections established before 09:00 will be allowed until closed. Any new connection after 09:00 will be dropped.
es: Las reglas que tienen condiciones de tiempo se aplican sólo para nuevas conexiones. Ejemplo: si está bloqueando conexiones HTTP de 09:00 a 18:00, las conexiones establecidas antes de las 09:00 serán permitidas hasta que se cierre. Cualquier nueva conexión después de las 09:00 será eliminada.

source: IP/MAC binding
es: Enlace IP/MAC

source: When the system is acting as DHCP server, the firewall can use the list of DHCP reservations to strictly check all traffic generated from hosts inside local networks. When :index:`IP/MAC binding` is enabled, the administrator will choose what policy will be applied to hosts without a DHCP reservation. The common use is to allow traffic only from known hosts and block all other traffic. In this case, hosts without a reservation will not be able to access the firewall nor the external network.
es: Cuando el sistema actúa como servidor DHCP, el cortafuego puede utilizar la lista de reservas de DHCP para verificar estrictamente todo el tráfico generado desde los hosts dentro de las redes locales. Cuando :index:`Enlace IP/MAC` está habilitado, el administrador elegirá qué política se aplicará a los hosts sin una reserva de DHCP. El uso común es permitir el tráfico solamente desde los anfitriones conocidos y bloquear todo el otro tráfico. En este caso, los hosts sin reserva no podrán acceder al cortafuego ni a la red externa.

source: To enable traffic only from well-known hosts, follow these steps:
es: Para habilitar el tráfico sólo desde hosts bien conocidos, siga estos pasos:

source: Create a DHCP reservation for a host
es: Crear una reserva DHCP para un host

source: Go to :menuselection:`Firewall rules` page and select from :guilabel:`Configure` from the button menu
es: Vaya a la página :menuselection:`Reglas firewall` y seleccione :guilabel:`Configurar` en el menú de botones

source: Select :guilabel:`MAC validation (IP/MAC binding)`
es: Seleccione :guilabel:`Validación MAC (enlace IP/MAC)`

source: Choose :guilabel:`Block traffic` as policy to apply to unregistered hosts
es: Elija :guilabel:`Bloquear tráfico` como directiva para aplicar a hosts no registrados

source: Remember to create at least one DHCP reservation before enabling the IP/MAC binding mode, otherwise no hosts will be able to manage the server using the web interface or SSH.
es: Recuerde crear al menos una reserva DHCP antes de habilitar el enlace IP/MAC, de lo contrario ningún host será capaz de administrar el servidor utilizando la interfaz web o SSH.
