Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/index.po
Languages: es

source: Administrator Manual
es: Manual del Administrador

source: `Web site <http://www.nethserver.org>`_
es: `Web <http://www.nethserver.org>`_

source: `Community <http://community.nethserver.org>`_
es: `Comunidad <http://community.nethserver.org>`_

source: `Developer manual <http://docs.nethserver.org/projects/nethserver-devel>`_
es: `Manual de Desarrollador <http://docs.nethserver.org/projects/nethserver-devel>`_

source: Support: `helpdesk.nethesis.it <http://helpdesk.nethesis.it>`_
es: Soporte: `helpdesk.nethesis.it <http://helpdesk.nethesis.it>`_

source: Official site: `www.nethesis.it <http://www.nethesis.it>`_
es: Sitio oficial: `www.nethesis.it <http://www.nethesis.it>`_

source: Release notes |version|
es: Notas de lanzamiento |version|

source: Installation
es: Instalación

source: Configuration
es: Configuración

source: Modules
es: Módulos

source: NethForge modules
es: Módulos NethForge

source: Best practices
es: Mejores prácticas

source: Appendix
es: Apéndice

source: Indices
es: Índices

source: :ref:`General index <genindex>`
es: :ref:`Índice general <genindex>`

source: :ref:`Search <search>`
es: :ref:`Buscar <search>`
