Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/packages.po
Languages: es

source: Software center
es: Centro de software

source: |product| is highly modular. At the end of the installation a bare minimum set of modules are ready to be used. The basic system includes modules like *network configuration* and *log viewer*. Additionally, the administrator can install additional modules, like :ref:`email-section`, :ref:`dhcp-section`, :ref:`firewall-section`...
es: |product| es altamente modular. Al final de la instalación, un conjunto mínimo de módulos está listo para ser utilizado. El sistema básico incluye módulos como *configuración de red* y *visualizador de registro*. Además, el administrador puede instalar módulos adicionales, como :ref:`email-section`, :ref:`dhcp-section`, :ref:`firewall-section`...

source: The :guilabel:`Available` tab lists all of the modules that can be installed. This list can be filtered by category.
es: La pestaña :guilabel:`Disponible` enumera todos los módulos que se pueden instalar. Esta lista puede ser filtrada por categoría.

source: To **install a module**, check the corresponding box and click on :guilabel:`Add`. Some modules suggest optional packages that can be installed whether at the same or at a later time.
es: Para **instalar un módulo**, marque la casilla correspondiente y haga clic en :guilabel:`Añadir`. Algunos módulos sugieren paquetes opcionales que pueden instalarse ya sea al mismo tiempo o posteriormente.

source: To **install optional packages** at a later time, select :guilabel:`Installed` tab and push the :guilabel:`Edit` button on a listed entry.
es: Para **instalar paquetes opcionales** en un momento posterior, seleccione la pestaña :guilabel:`Instalado` y pulse el botón :guilabel:`Editar` en una entrada en la lista.

source: To **remove a module**, push the :guilabel:`Remove` button.
es: Para **eliminar un módulo**, pulse el botón :guilabel:`Eliminar`.

source: When removing a module other modules could be removed, too! Read carefully the list of affected packages to avoid removing required features.
es: ¡Al quitar un módulo también se podrían quitar otros módulos! Lea cuidadosamente la lista de paquetes afectados para evitar la eliminación de las funciones necesarias.

source: Software updates
es: Actualizaciones de software

source: Updates for the installed software are listed under the :guilabel:`Updates` tab. A message appears when software updates are available.
es: Las actualizaciones para el software instalado aparecen en la pestaña :guilabel:`Actualizaciones`. Se mostrará un mensaje cuando hay actualizaciones de software disponibles.

source: More info on upstream updates:
es: Más información sobre las actualizaciones más recientes

source: Regularly update the installed software to fix bugs, security issues and receive new features.
es: Actualiza regularmente el software instalado para corregir errores, problemas de seguridad y recibir nuevas funciones.

source: Updates will be automatically installed by a scheduled procedure.
es: Las actualizaciones se instalarán automáticamente mediante un procedimiento programado.

source: List of installed packages
es: Lista de paquetes instalados

source: The complete list of installed RPM packages is available under :guilabel:`Installed > Packages`.
es: La lista completa de los paquetes RPM instalados está disponible en :guilabel:`Instalado > Paquetes`.

source: The section :guilabel:`Installed software` displays all packages already installed into the system with the full package version.
es: La sección :guilabel:`Software instalado` muestra todos los paquetes ya instalados en el sistema con la versión completa del paquete.

source: Additional languages
es: Idiomas adicionales

source: The Server Manager allows selecting the interface language at the login screen. Only installed languages are listed.
es: El Administrador de servidores permite seleccionar el idioma de la interfaz en la pantalla de inicio de sesión. Sólo se muestran los idiomas instalados.

source: In :guilabel:`Available` tab, select the :guilabel:`Languages` category and install the desired languages.
es: En la pestaña :guilabel:`Disponible`, seleccione la categoría :guilabel:`Idiomas` e instale los idiomas que desee.
