Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/pop3_connector.po
Languages: es

source: POP3 connector
es: Conector POP3

source: The :guilabel:`POP3 connector` page allows configuring a list of mail accounts that will be checked regularly. Messages coming from the remote accounts will be delivered to local users.
es: La página :guilabel:`Conector POP3` permite configurar una lista de cuentas de correo que se verán con regularidad. Los mensajes procedentes de las cuentas remotas se entregarán a los usuarios locales.

source: It is not recommended to use the POP3 connector as the primary method for managing email. Mail delivery can be affected by disk space and connectivity problems of the provider's server. Also, the spam filter will be less effective due to the original email envelope information becoming lost.
es: No se recomienda utilizar el conector POP3 como método principal de administración de correo electrónico. La entrega de correo puede verse afectada por el espacio en disco y los problemas de conectividad del servidor del proveedor. Además, el filtro de spam será menos efectivo debido a la información original del sobre de correo electrónico que se pierde.

source: POP3/IMAP accounts are configured from :guilabel:`POP3 connector > Accounts` page. Each account can be specified:
es: Las cuentas POP3/IMAP se configuran desde la página :guilabel:'Conector POP3 > Cuentas'. Cada cuenta se puede especificar:

source: the email address (as unique account identifier)
es: la dirección de correo electrónico (como identificador de cuenta único)

source: the protocol (IMAP/POP3/IMAP with SSL/POP3 with SSL)
es: el protocolo (IMAP/POP3/IMAP con SSL/POP3 con SSL)

source: the remote server address
es: La dirección del servidor remoto

source: the account credentials
es: Las credenciales de la cuenta

source: the local user account where to deliver messages
es: La cuenta de usuario local donde entregar mensajes

source: if a message has to be deleted from the remote server after delivery
es: Si hay que borrar un mensaje desde el servidor remoto hacerlo después de la entrega

source: It is allowed to associate more than one external accounts to a local one. Deleting an account will *not* delete already delivered messages.
es: Se permite asociar más de una cuenta externa a una local. La eliminación de una cuenta *no* eliminará los mensajes ya entregados.

source: After the account configuration has been completed, the account is automatically checked for new mail.
es: Una vez completada la configuración de la cuenta, se comprueba automáticamente si hay correo nuevo.

source: The underneath implementation is based on :dfn:`Getmail` [#Getmail]_. After fetching mail messages from the POP3/IMAP provider Getmail applies all required filters (SPAM and virus) prior to delivering the mail locally. All messages are filtered according to the :ref:`configured rules <email_filter>`.
es: La implementación en si se basa en :dfn:`Getmail` [#Getmail]_. Después de recuperar los mensajes de correo del proveedor POP3/IMAP Getmail aplica todos los filtros necesarios (SPAM y virus) antes de entregar el correo localmente. Todos los mensajes se filtran de acuerdo con :ref:`reglas configuradas <email_filter>`.

source: All operations are logged in :file:`/var/log/maillog`.
es: Todas las operaciones se registran en :file:`/var/log/maillog`.

source: If an account was selected for delivery and has been subsequently deleted the configuration becomes inconsistent. If this should happen then existing account configuration in :guilabel:`POP3 connector` page must be disabled or deleted.
es: Si se seleccionó una cuenta para la entrega y se ha suprimido posteriormente, la configuración se vuelve incoherente. Si esto sucede, la configuración de la cuenta existente en :guilabel:`Conector POP3` debe estar deshabilitada o borrada.

source: References
es: Referencias

source: Getmail is a remote-mail retrieval utility http://pyropus.ca/software/getmail/
es: Getmail es una utilidad de recuperación remota de correo http://pyropus.ca/software/getmail/
