Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/release_notes.po
Languages: es

source: Release notes |version|
es: Notas de lanzamiento |version|

source: |product| release |version|
es: |product| versión |version|

source: This release is based on CentOS 7.3: https://wiki.centos.org/Manuals/ReleaseNotes/CentOS7
es: Esta versión se basa en CentOS 7.3: https://wiki.centos.org/Manuals/ReleaseNotes/CentOS7

source: Relevant changes since RC4:
es: Cambios relevantes desde RC4:

source: Installer: added new manual installation method
es: Instalador: nuevo método de instalación manual

source: Account providers: "administrators" group has been replaced by "domain admins" group (:ref:`server_manager-section`)
es: Proveedores de cuentas: el grupo "administradores" ha sido sustituido por el grupo "administradores de dominio" (:ref:`server_manager-section`)

source: Mail server: fix pseudonym expansion for groups
es: Servidor de correo: corrige la expansión del pseudónimo para grupos

source: Mail server: enable user shared mailbox by default (:ref:`enable_shared_folders-section`)
es: Servidor de correo: habilita el buzón de correo compartido del usuario de forma predeterminada (:ref:`enable_shared_folders-section`)

source: Mail server: specific per-domain pseudonym now override generic ones
es: Servidor de correo: el seudónimo específico por dominio ahora sustituye a los genéricos

source: OpenVPN: start VPN clients on boot
es: Servidor de correo: el seudónimo específico por dominio ahora sustituye a los genéricos

source: Web filter: fix group-based profiles
es: Filtro Web: fijar perfiles basados en grupos

source: Firewall: fix selection of time conditions
es: Firewall: Selecciona correcciones según condiciones de tiempo

source: IPS: update configuration for latest pulledpork release
es: IPS: actualiza la configuración para la última liberación preferida

source: Upgrading RC4 to Final
es: Actualización de RC4 a Final

source: To upgrade a RC4 installation to Final, go to the :guilabel:`Software Center` page and follow Server Manager instructions.
es: Para actualizar una instalación de RC4 a Final, vaya a la página :guilabel:`Centro de software` y siga las instrucciones del Administrador del servidor

source: Upgrading |product| 6 to |product| |version|
es: Actualizando |product| 6 a |product| |version|

source: It is possible to upgrade the previous major release of |product| to |version|, with a backup/restore strategy. See the :ref:`upgrade-section` for details.
es: Es posible actualizar completa la versión anterior de |product| a |version|, mediante una estrategia de respaldo/recuperación. Vea :ref:`upgrade-section` para más detalles.

source: Server Manager access
es: Acceso al Administrador del servidor

source: If you want to grant Server Manager access to other users than root, please add the users to the "domain admins" group and execute: ::
es: Si desea conceder al Administrador del servidor acceso a otros usuarios que root, agregue los usuarios al grupo de "administradores de dominio" y ejecute: ::

source: User shared mailbox
es: Buzón de correo compartido del usuario

source: If you want to enable user shared mailbox, execute: ::
es: Si desea habilitar el buzón de correo compartido de usuario, ejecute: ::

source: Changelog
es: Registro de cambios

source: `ISO Final changelog <https://github.com/NethServer/dev/issues?utf8=%E2%9C%93&q=is%3Aissue%20is%3Aclosed%20milestone%3Av7%20closed%3A2017-01-17T00%3A00%3A00Z..2017-01-30>`_ (from 2017-01-17 to 2017-01-30)
es: `Log de cambios final de la ISO<https://github.com/NethServer/dev/issues?utf8=%E2%9C%93&q=is%3Aissue%20is%3Aclosed%20milestone%3Av7%20closed%3A2017-01-17T00%3A00%3A00Z..2017-01-30>`_ (de 2017-01-17 a 2017-01-30)

source: `Rolling release changelog <https://github.com/NethServer/dev/issues?utf8=%E2%9C%93&q=is%3Aissue%20is%3Aclosed%20milestone%3Av7%20closed%3A2017-01-30T23%3A59%3A59Z..2024-06-30>`_ (from 2017-01-30 to 2024-06-30)
es: `Registro de cambios de la liberación continua <https://github.com/NethServer/dev/issues?utf8=%E2%9C%93&q=is%3Aissue%20is%3Aclosed%20milestone%3Av7%20closed%3A2017-01-30T23%3A59%3A59Z..2024-06-30>`_ (de 2017-01-30 a 2024-06-30)

source: Known bugs
es: Errores conocidos

source: List of `known bugs <https://github.com/NethServer/dev/issues?utf8=%E2%9C%93&q=is%3Aissue%20is%3Aopen%20label%3Abug%20milestone%3Av7%20>`_
es: Lista de `errores conocidos <https://github.com/NethServer/dev/issues?utf8=%E2%9C%93&q=is%3Aissue%20is%3Aopen%20label%3Abug%20milestone%3Av7%20>`_

source: Discussions around `possible bugs <http://community.nethserver.org/c/bug>`_
es: Discusiones sobre `posibles errores <http://community.nethserver.org/c/bug>`_

source: Discontinued packages
es: Paquetes descontinuados

source: The following packages were available in the previous 6 release and have been removed in 7:
es: Los siguientes paquetes estaban disponibles en la versión anterior 6 y se han eliminado en 7:

source: nethserver-collectd-web: replaced by nethserver-cgp
es: nethserver-collectd-web: reemplazado por nethserver-cgp

source: nethserver-password: integrated inside nethserver-sssd
es: nethserver-password: integrado en nethserver-sssd

source: nethserver-faxweb2: see the discussion `faxweb2 vs avantfax <http://community.nethserver.org/t/ns-7-faxweb2-vs-avantafax/2645>`_.
es: nethserver-faxweb2: vea la discusión `faxweb2 vs avantfax <http://community.nethserver.org/t/ns-7-faxweb2-vs-avantafax/2645>`_.

source: nethserver-fetchmail: replaced by getmail
es: nethserver-fetchmail: reemplazado por getmail

source: nethserver-ocsinventory, nethserver-adagios: due to compatibility problems with Nagios, these modules will be mantained only on |product| 6 release
es: nethserver-ocsinventory, nethserver-adagios: debido a problemas de compatibilidad con Nagios, estos módulos se mantendrán sólo en la liberación |product| 6
