Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/shared_folder.po
Languages: es

source: Shared folders
es: Carpetas compartidas

source: A *shared folder* is a place where files can be accessed by a group of people using Samba (SMB/CIFS).
es: Una *carpeta compartida* es un lugar donde un grupo de personas puede acceder a los archivos mediante Samba (SMB/CIFS).

source: To create, edit and delete a shared folder go to the :guilabel:`Shared folders` page.
es: Para crear, editar y borrar una carpeta compartida vaya a la pagina :guilabel:`Carpetas compartidas`

source: Authorizations
es: Autorizaciones

source: If **Active directory** is selected as account provider, a shared folder is owned by a group of users (:guilabel:`Owning group`). Each member of the group is allowed to read the folder contents. Optionally the group can be entitled to modify the folder contents and the read permission can be extended to everyone accessing the system. This simple permission model is based on the traditional UNIX file system permissions.
es: Si **Active directory** está seleccionado como proveedor de cuentas, una carpeta compartida pertenece a un grupo de usuarios (:guilabel:`Grupo propietario`). A cada miembro del grupo se le permite leer el contenido de la carpeta. Opcionalmente, el grupo puede tener derecho a modificar el contenido de la carpeta y el permiso de lectura se puede extender a todos los que acceden al sistema. Este modelo de permiso simple se basa en los permisos tradicionales del sistema de archivos UNIX.

source: Access privileges can be refined further with the :guilabel:`ACL` tab, allowing individual users and other groups to gain read and write permissions.
es: Los privilegios de acceso se pueden refinar aún más con la pestaña :guilabel:`ACL`, que permite a los usuarios individuales ya otros grupos obtener permisos de lectura y escritura.

source: If :guilabel:`Guest access` is enabled, any provided authentication credentials are considered valid.
es: Si :guilabel:`Guest access` está habilitado, las credenciales de autenticación proporcionadas se consideran válidas.

source: If an **LDAP** account provider is selected or there is no account provider at all, any access to shared folders is considered as *Guest access* so that everyone is allowed to read and write its content.
es: Si se selecciona un proveedor de cuenta **LDAP** o no hay ningún proveedor de cuentas, el acceso a carpetas compartidas se considera como *Acceso de invitado* para que todos puedan leer y escribir su contenido.

source: Network access
es: Acceso a la red

source: SMB/CIFS is a widely adopted protocol that allows to share files across a computer network. The shared folder name becomes the SMB "share name".
es: SMB/CIFS es un protocolo ampliamente utilizado que permite compartir archivos a través de una red de computadoras. El nombre de la carpeta compartida se convierte en el SMB "nombre de recurso compartido".

source: For instance, the SMB network addresses of the ``docs`` share could be ::
es: Por ejemplo, las direcciones de red SMB de la carpeta ``documentos`` podrían ser ::

source: Authenticated access to shared folders is available with an Active Directory accounts provider. LDAP provider allows guest access only.
es: El acceso autenticado a carpetas compartidas está disponible con un proveedor de cuentas de Active Directory. El proveedor LDAP sólo permite el acceso de invitados.

source: When accessing a SMB share, some user interfaces provide a single user name field. In that case, specify the **user short name** prefixed with the **NetBIOS domain name**. For instance, if the NetBIOS domain name is "DOMAIN" and the user name is "john.smith", the domain-prefixed user name to access a SMB share is: ::
es: Cuando se accede a un recurso compartido SMB, algunas interfaces de usuario solo proveen el nombre de usuario en el campo. En este caso, especifique el **nombre de usuario corto** con el prefijo **Nombre de dominio NetBIOS**. Por ejemplo, si el nombre de dominio NetBIOS es "DOMAIN", y el usuario es "jhon.smith", el nombre de usuario con el prefijo de dominio para acceder al recurso compartido SMB es: ::

source: On the contrary, some applications provide separate input fields for the NetBIOS domain name and the user name; in that case fill in the input fields individually.
es: Por el contrario, algunas aplicaciones proveen campos separados para el nombre de dominio NetBIOS y el nombre de usuario; en este caso llene cada uno de los campos individualmente.

source: Network recycle bin
es: Papelera de reciclaje en red

source: If the option :guilabel:`Network recycle bin` is enabled, removed files are actually moved into a special "wastebasket" directory. The :guilabel:`Keep copies of files with the same name` keeps distinct file names inside the wastebasket directory, preventing overwrites.
es: Si la opción :guilabel:`Papelera de reciclaje en red` está habilitada, los archivos removidos son reubicados en un directorio "papelera" especial . La opción :guilabel:`Guardar copias de archivos con el mismo nombre` mantiene distintos nombres de archivos en el directorio "papelera", evitando sobrescrituras.

source: Hide a shared folder
es: Ocultar una carpeta compartida

source: If :guilabel:`Browseable` is enabled, the shared folder is listed publicly. This does not affect the permission to use this resource.
es: Si :guilabel:`Navegable` está habilitado, la carpeta compartida aparece públicamente. Esto no afecta al permiso para usar este recurso.

source: Home share
es: Carpeta de usuario compartida

source: Each |product| user has a personal shared folder that is mapped to his Unix home directory. The SMB share name correspond to the **user short name**. For example:
es: Cada usuario de |product| tiene una carpeta personal y compartida que es mapeada a su directorio home en Unix. El nombre de la carpeta de usuario compartida corresponde al **user short name**. Por ejemplo:

source: user short name ``john.smith``
es: nombre de usuario ``john.smith``

source: server name ``MYSERVER``
es: nombre del servidor ``MYSERVER``

source: server address ``192.168.1.2``
es: dirección del servidor ``192.168.1.2``

source: The SMB network address is: ::
es: La dirección de la red SMB es: ::

source: Provide John's credentials as explained in :ref:`smb-access-section`.
es: Provee las credenciales de John's como se explica en :ref:`smb-access-section`

source: The Unix home directory is created the first time the user accesses it by either SMB or SFTP/SSH protocol.
es: El directorio de usuario compartido Unix es creado la primera vez que se accede mediante los protocolos SMB o SFTP/SSH
