Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/subscription.po
Languages: es

source: |product| subscription
es: Suscripción a |product|

source: A |product| installation can be registerd to a public or private Dartagnan [#Dartagnan]_ instance, getting access to monitoring portal and stable update repositories.
es: La instalación de |product| se puede registrar en una instancia Dartagnan [#Dartagnan]_ pública o privada, obteniendo acceso al portal de monitoreo y repositorios de actualización estables.

source: The |product| Subscription by Nethesis [#Nethesis]_ enables access to a public ready-to-use Dartagnan instance, along with immediate professional support services for your |product| deployments.
es: La suscripción de |product| por Nethesis [#Nethesis]_ permite el acceso a una instancia pública de Dartagnan lista para usar, junto con servicios de soporte profesional inmediatos para sus implementaciones en |product| .

source: Detailed info available: https://my.nethserver.com
es: Información detallada disponible en: https://my.nethserver.com

source: Register an installation
es: Registro e instalación

source: Access :guilabel:`Subscription` page from the Server Manager
es: Accede a la página :guilabel:`Subscription` desde el Panel de Control

source: Click on :guilabel:`Subscribe`
es: Haz clic en :guilabel:`Subscribe`

source: Login or register to https://my.nethserver.com to obtain a registration code
es: Inicia sesión o regístrate en https://my.nethserver.com para obtener un código de registro

source: Copy and paste the code inside the :guilabel:`Registration token` field
es: Copia y pega el código en el campo :guilabel:`Registration token`

source: Click on :guilabel:`Register now` button
es: Haz clic en el botón :guilabel:`Register now`

source: At the end, the subscription plan name and validity are reported inside the page. Monitoring and access to stable repositories are automatically enabeld.
es: Al final, el nombre y la validez del plan de suscripción se informan dentro de la página. La supervisión y el acceso a los repositorios estables se activan automáticamente.

source: Dartagnan documentation: https://nethesis.github.io/dartagnan/
es: Documentación Dartagnan: https://nethesis.github.io/dartagnan/

source: Nethesis official site: http://www.nethesis.it
es: Web oficial de Nethesis: http://www.nethesis.it
