Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/third_party.po
Languages: es

source: Third-party software
es: Software de terceros

source: You can install any CentOS/RHEL certified :index:`third-party software` on |product|.
es: Puede instalar cualquier certificado CentOS/RHEL :index:`software de terceros` en |product|.

source: If the software is 32-bit only, you should install compatibility libraries before installing the software. Relevant libraries should be:
es: Si el software es de 32 bits solamente, debe instalar las bibliotecas de compatibilidad antes de instalar el software. Las bibliotecas relevantes deben ser:

source: For example, to install the above mentioned packages: ::
es: Por ejemplo, para instalar los paquetes mencionados anteriormente: ::

source: Installation
es: Instalación

source: If the software is an RPM package, please use :command:`yum` to install it: the system will take care to resolve all needed dependencies.
es: Si el software es un paquete RPM, utilice :command:`yum` para instalarlo: el sistema se encargará de resolver todas las dependencias necesarias.

source: In case a yum installation is not possible, the best target directory for additional software is under :file:`/opt`. For example, given a software named *mysoftware*, install it on :file:`/opt/mysoftware`.
es: En caso de que una instalación de yum no sea posible, el mejor directorio de destino para software adicional está en :file:`/opt`. Por ejemplo, dado un software llamado *mysoftware*, instálelo en :file:`/opt/mysoftware`.

source: Backup
es: Copia de seguridad

source: Directory containing relevant data should be included inside the backup by adding a line to :file:`/etc/backup-data.d/custom.include`. See :ref:`backup_customization-section`.
es: El directorio que contiene datos relevantes debe incluirse dentro de la copia de seguridad añadiendo una línea a :file:`/etc/backup-data.d/custom.include`. Véase :ref:`backup_customization-section`.

source: If the software needs some open ports on the firewall, create a new service named ``fw_<softwarename>``.
es: Si el software necesita algunos puertos abiertos en el firewall, cree un nuevo servicio llamado ``fw_<softwarename>``.

source: For example, given the software *mysoftware* which needs ports 3344 and 5566 on LAN, use the following commands: ::
es: Por ejemplo, dado el software *mysoftware* que necesita los puertos 3344 y 5566 en LAN, utilice los siguientes comandos: ::

source: Starting and stopping
es: Inicio y detención

source: |product| uses the standard systemd multiuser target.
es: |product| utiliza el destino multiusuario estándar para systemd.

source: Software installed with yum should already be configured to start at boot. To check the configuration, execute the :command:`systemctl` command. The command will display a list of services with their own status.
es: El software instalado con yum ya debería estar configurado para iniciarse al arrancar. Para comprobar la configuración, ejecute el comando :command:`systemctl`. Este mostrará una lista de servicios con su propio estado.

source: To enable a service on boot: ::
es: Para habilitar un servicio en boot: ::

source: To disable a service on boot: ::
es: Para deshabilitar un servicio en boot: ::
