Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/tlspolicy.po
Languages: es

source: TLS policy
es: Política de TLS

source: The :guilabel:`TLS policy` page controls how individual services configure the Transport Layer Security (TLS) protocol, by selecting a *policy identifier*.
es: La página :guilabel:`TLS policy` controla cómo los servicios individuales configuran el protocolo de seguridad de la capa de transporte (TLS), seleccionando un *identificador de política*.

source: Each module implementation decides how to implement a specific policy identifier, providing a trade off between security and client compatibility. Newer policies are biased towards security, whilst older ones provide better compatibility with old clients.
es: Cada implementación de módulo decide cómo implementar un identificador de política específico, ofreciendo una compensación entre la seguridad y la compatibilidad del cliente. Las políticas más recientes están sesgadas hacia la seguridad, mientras que las más antiguas ofrecen una mejor compatibilidad con los clientes antiguos.

source: The following sections describe each policy identifier.
es: Las siguientes secciones describen cada identificador de política.

source: Policy 2018-03-30
es: Política 2018-03-30

source: See https://bettercrypto.org/static/applied-crypto-hardening.pdf category B
es: Ver https://bettercrypto.org/static/applied-crypto-hardening.pdf categoría B

source: Cipher suite ::
es: Suite de cifrado ::

source: Disabled SSLv2 and SSLv3
es: Deshabilitados SSLv2 y SSLv3

source: See https://github.com/NethServer/nethserver-openssh/pull/6
es: Ver https://github.com/NethServer/nethserver-openssh/pull/6

source: Configuration snippet ::
es: Snippet de configuración ::

source: Use TLS in outbound connections, if remote server supports it
es: Use TLS en las conexiones de salida, si el servidor remoto lo admite

source: Disable SSLv2 and SSLv3 on submission ports
es: Deshabilitar SSLv2 y SSLv3 en los puertos de envío

source: Exclude ciphers ::
es: Excluir cifrados ::

source: Default upstream policy
es: Política de subida predeterminada

source: The goal of this policy is retaining upstream settings. This is the original goal since |product| 7.
es: El objetivo de esta política es mantener la configuración del caudal de subida. Este es el objetivo original desde |product| 7.
