Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/ups.po
Languages: es

source: |product| supports the management of :index:`UPS` (Uninterruptible Power Supply) connected to the system.
es: |product| soporta la gestión de :index:`UPS` (Uninterruptible Power Supply - Fuente de Poder Ininterrumpible) conectado al sistema.

source: The server can be configured in two ways:
es: El servidor se puede configurar de dos maneras:

source: *master*: UPS is directly connected to the server, the server accepts connections from slaves
es: *maestro*: UPS está conectado directamente al servidor, el servidor acepta conexiones de esclavos

source: *slave*: UPS is connected to another server accessible over the network
es: *esclavo*: El UPS está conectado a otro servidor accesible a través de la red

source: You should consult the list of supported models before buying. Via *Administration > Software center* install the UPS package. In *Configuration* appears the new entry *UPS* where can be find the supported model by typing in *Search driver for model* field.
es: Debe consultar la lista de modelos compatibles antes de comprar. Vía *Administración > Centro de software* instale el paquete UPS. En *Configuración* aparece la nueva entrada *UPS* donde se puede encontrar el modelo soportado escribiendo en el campo *Buscar controlador para el modelo*.

source: In :index:`master` mode, the UPS can be connected to the server:
es: En modo :index:`maestro`, el UPS puede conectarse al servidor:

source: on a serial port
es: en un puerto serial

source: on a USB port
es: en un puerto USB

source: with a USB to serial adapter
es: con un adaptador USB a serial

source: In :index:`slave` mode, you will need to provide the IP address of the master server.
es: En modo :index:`esclavo`, deberá proporcionar la dirección IP del servidor maestro

source: The default configuration provides a controlled shutdown in the event of the absence of power.
es: La configuración predeterminada proporciona un apagado controlado en caso de ausencia de alimentación.

source: Custom device
es: Dispositivo personalizado

source: If the UPS is connected to a port that is not listed in the web interface, you can configure a custom device with the following commands: ::
es: Si el UPS está conectado a un puerto que no aparece en la interfaz web, puede configurar un dispositivo personalizado con los siguientes comandos: ::

source: UPS statistics
es: Estadísticas del UPS

source: If the statistics module (collectd) is installed and running, the module will automatically collect statistic data about UPS status.
es: Si el módulo estadístico (collectd) está instalado y funcionando, el módulo recopilará automáticamente datos estadísticos sobre el estado del UPS.
