Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/webmail.po
Languages: es

source: The default :index:`webmail` client is :index:`Roundcube`. Roundcube's main features are:
es: El cliente predeterminado :index:`webmail` es :index:`Roundcube`. Las principales características de Roundcube son:

source: Simple and fast
es: Simple y rápido

source: Built-in address book integrated with internal LDAP
es: Libreta de direcciones integradas adaptado con LDAP interno

source: Support for HTML messages
es: Soporte para mensajes HTML

source: Shared folders support
es: Soporte para carpetas compartidas

source: The webmail is available at the following URLs:
es: El webmail está disponible en las siguientes URL:

source: For example, given a server with IP address *192.168.1.1* and name *mail.mydomain.com*, valid addresses are:
es: Por ejemplo, dado un servidor con dirección IP *192.168.1.1 * y nombre *mail.mydomain.com*, las direcciones válidas son:

source: If |product| is bound to a remote Active Directory account provider a dedicated user account in AD is required by the module to be fully operational! See :ref:`join-existing-ad-section`.
es: Si |product| es unido a un proveedor de cuentas Active Directory remoto, se necesita una cuenta AD dedicada para que el módulo esté completamente operativo. Ver :ref:`join-existing-ad-section`.

source: Roundcube supports many plugins that are already bundled within the installation.
es: Roundcube soporta muchos complementos que ya están incluidos en la instalación.

source: The plugins that are enabled by default are:
es: Los complementos habilitados por defecto son:

source: Manage sieve: manage filters for incoming mail
es: Administrar filtros: gestionar filtros para el correo entrante

source: Mark as junk: mark the selected messages as Junk and move them to the configured Junk folder
es: Marcar como basura: marque los mensajes seleccionados como basura y muévalos a la carpeta de correo no deseado configurada

source: Recommended plugins:
es: Complementos recomendados:

source: New mail notifier
es: Notificador de nuevo correo

source: Emoticons
es: Emoticonos

source: VCard support
es: Soporte VCard

source: Plugins can be added or removed by editing the comma-separated list inside the ``Plugins`` property. For example, to enable "mail notification", "mark as junk" and "manage sieve plugins", execute from command line: ::
es: Los complementos se pueden agregar o eliminar editando la lista separada por comas dentro de la propiedad ``Plugins``. Por ejemplo, para habilitar "notificación de correo", "marcar como basura" y "administrar filtrado", ejecute desde la línea de comandos: ::

source: A list of bundled plugins can be found inside ``/usr/share/roundcubemail/plugins`` directory. To get the list, just execute: ::
es: Se puede encontrar una lista de complementos agrupados dentro del directorio ``/usr/share/roundcubemail/plugins``. Para obtener la lista, ejecute: ::

source: Access
es: Acceso

source: With default configuration webmail is accessible using HTTPS from any network.
es: Con la configuración predeterminada webmail es accesible mediante HTTPS desde cualquier red.

source: If you want to restrict the access only from green and trusted networks, execute: ::
es: Si desea restringir el acceso sólo a redes verdes y de confianza, ejecute: ::

source: If you want to open the access from any network: ::
es: Si desea abrir el acceso desde cualquier red: ::

source: Removing
es: Quitar

source: If you want remove Roundcube, run the following command on the server command line. ::
es: Si desea eliminar Roundcube, ejecute el siguiente comando en la consola del servidor. ::
