Repository: Amygos/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/webtop4.po
Languages: es, it

source: WebTop is a full-featured groupware which implements ActiveSync protocol.
es: WebTop es un groupware completo que implementa el protocolo ActiveSync.
it: WebTop è un groupware completo che implementa il protocollo ActiveSync.

source: Access to web interface is: ``https://<server_name>/webtop``.
es: El acceso a la interfaz web es: ``https://<server_name>/webtop``.
it: L’indirizzo per accedere all’interfaccia web è: ``https://<nome_server>/webtop``.

source: Authentication
es: Autenticación
it: Autenticazione

source: When the server is configured to use a remote Account Provider, WebTop doesn't correctly fill name and surname of users. Every user should modify its own name and surname on first login.
es: Cuando el servidor está configurado para utilizar un proveedor de cuentas remoto, WebTop no rellena correctamente el nombre y el apellido de los usuarios. Cada usuario debe modificar su propio nombre y apellido en el primer inicio de sesión.
it: Quando il server è configurato per utilizzare un provider di account remoto, WebTop non compila correttamente il nome e cognome degli utenti. Ogni utente dovrebbe modificare il proprio nome e cognome al primo accesso.

source: Web interface
es: Interfaz web
it: Interfaccia web

source: The login method to the web application is with a simple user name and password, regardless of how many mail domains are configured.
es: El método de acceso a la aplicación web es con un nombre de usuario y una contraseña simples, independientemente de cuántos dominios de correo estén configurados.
it: Il login all’applicazione web è sempre effettuato usando utente semplice e password, a prescindere da quanti domini di posta siano configurati.

source: **Example**
es: **Ejemplo**
it: **Esempio**

source: Server name: mymail.mightydomain.com
es: Nombre del servidor: mymail.mightydomain.com
it: Nome server: mymail.mightydomain.com

source: Alternative mail domain: baddomain.net
es: Dominio de correo alternativo: baddomain.net
it: Dominio di posta alternativo: baddomain.net

source: User: goofy
es: Usuario: goofy
it: Utente: goofy

source: Login: goofy
es: Ingresar: goofy

source: Active Sync
es: Sincronización activa

source: Logging in to the Active Sync account can be accomplished with <username>@<domain> where ``<domain>`` is the domain part of server FQDN.
es: Iniciar sesión en la cuenta de Active Sync se puede realizar con <username>@<domain> donde ``<domain>`` es la parte del dominio del servidor FQDN.
it: Il login ad Active Sync è invece <utente>@<dominio> dove ``<dominio>`` è il dominio del server che fa parte del FQDN.

source: Login: goofy@mightydomain.com
es: Nombre de usuario: goofy@mightydomain.com

source: When configuring an Active Sync account, make sure to specify the server address and leave the domain field empty.
es: Al configurar una cuenta de Active Sync, asegúrese de especificar la dirección del servidor y de dejar el campo de dominio vacío.
it: Quando si configura un account Active Sync, assicurarsi di specificare l’indirizzo del server e lasciare vuoto il campo dominio.

source: Active Sync protocol is supported only on Android and iOS devices. Outlook is not supported. Mail synchronization is currently not supported.
es: El protocolo Active Sync sólo se admite en dispositivos Android e iOS. Outlook no es compatible. La sincronización de correo no es compatible actualmente.
it: Il protocollo Active Sync è supportato solo su dispositivi Android e iOS. Outlook non è supportato. La sincronizzazione della posta non è al momento supportata.

source: Admin user
es: Usuario administrador
it: Utente admin

source: After installation, WebTop will be accessible via the administrator user. The administrator user can change global settings and login as all other users, however, it's not a system user and can't access any other services like Mail, Calendar, etc.
es: Después de la instalación, WebTop será accesible a través del usuario administrador. El usuario administrador puede cambiar la configuración global y el inicio de sesión como todos los demás usuarios, sin embargo, no es un usuario del sistema y no puede acceder a otros servicios como correo, calendario, etc.
it: Dopo l’installazione, WebTop è accessibile con un utente amministrativo. L’utente amministrativo può cambiare le impostazioni globali ed effettuare login come un altro utente, ma non è un utente di sistema e non può accedere agli altri servizi come Mail, Calendario, ecc.

source: Default credentials are:
es: Las credenciales predeterminadas son:
it: Le credenziali di default sono:

source: User: admin
es: Usuario: admin
it: Utente: admin

source: Password: admin
es: Contraseña: admin

source: The administrator user's password must be changed from within the WebTop interface.
es: La contraseña del usuario administrador debe cambiarse desde dentro de la interfaz WebTop.
it: La password del’utente admin deve essere cambiata dall’interfaccia di WebTop.

source: **Remember to change the admin password just after installation!**
es: **¡Recuerde cambiar la contraseña de administrador justo después de la instalación!**
it: **Ricordarsi di cambiare la password di amministratore subito dopo l’installazione!**

source: To check the mail of the system's user admin account use the following login: admin@<domain> where ``<domain>`` is the domain part of server FQDN.
es: Para comprobar el correo de la cuenta de administrador de usuario del sistema, utilice el siguiente inicio de sesión: admin@<domain> donde ``<domain>`` es la parte del dominio del servidor FQDN.
it: E’ possibile controllare la posta dell’utente admin di sistema usando questo login: admin@<dominio> dove ``<dominio>`` è il dominio del server che fa parte del FQDN.

source: Login: admin@mightydomain.com
es: Nombre de usuario: admin@mightydomain.com

source: WebTop and SOGo can be installed on the same machine.
es: WebTop y SOGo se pueden instalar en la misma máquina.
it: WebTop e SOGo possono essere installati sulla stessa macchina.

source: ActiveSync is enabled by default on SOGo and WebTop, but if both packages are installed, SOGo will take precedence.
es: ActiveSync está habilitada de forma predeterminada en SOGo y WebTop, pero si ambos paquetes están instalados, SOGo tendrá prioridad.
it: ActiveSync è abilitato di default sia su SOGo che su WebTop, ma se sono entrambi installati, SOGo avrà la precedenza.

source: To disable ActiveSync on SOGo: ::
es: Para deshabilitar ActiveSync en SOGo: ::
it: Per disabilitare ActiveSync su SOGo: ::

source: To disable ActiveSync on WebTop: ::
es: Para deshabilitar ActiveSync en WebTop: ::
it: Per disabilitare ActiveSync su WebTop: ::

source: All incoming mail filters configured within SOGo, must be manually recreated inside WebTop interface. This also applies if the user is switching from WebTop to SOGo.
es: Todos los filtros de correo entrantes configurados dentro de SOGo, deben ser recreados manualmente dentro de la interfaz WebTop. Esto también se aplica si el usuario está cambiando de WebTop a SOGo.
it: Tutti i filtri di posta configurati da SOGo, devono essere ricreati manualmente all’interno dell’interfaccia di WebTop. La stessa cosa si applica se l’utente sta effettuando il passaggio inverso da WebTop a SOGo.

source: Importing from SOGo
es: Importando desde SOGo
it: Importazione da SOGo

source: **Please read all directions before importing any data to ensure import is successful**
es: **Por favor, lea todas las instrucciones antes de importar cualquier dato para asegurar que la importación sea exitosa**
it: **Si prega di leggere tutte le istruzioni prima di importare tutti i dati al fine di garantire una corretta importazione**

source: Migration of Calendar and Address book data from SOGo to WebTop can be accomplished by using the following scripts, and following the steps listed below:
es: La migración de los datos del calendario y de la libreta de direcciones de SOGo a WebTop se puede realizar mediante las siguientes secuencias de comandos y siguiendo los pasos que se enumeran a continuación:
it: E’ possibile migrare Calendari e Rubriche da SOGo a WebTop utilizzando i seguenti script e seguendo i passaggi elencati di seguito:

source: Calendars: :file:`/usr/share/webtop/doc/sogo2webtop_cal.php`
es: Calendarios: :file:`/usr/share/webtop/doc/sogo2webtop_cal.php`
it: Calendari: :file:`/usr/share/webtop/doc/sogo2webtop_cal.php`

source: Address books: :file:`/usr/share/webtop/doc/sogo2webtop_card.php`
es: Libretas de direcciones: :file:`/usr/share/webtop/doc/sogo2webtop_card.php`
it: Rubriche: :file:`/usr/share/webtop/doc/sogo2webtop_card.php`

source: Before using the scripts you need to install this package: ::
es: Antes de utilizar las secuencias de comandos, debe instalar este paquete: ::
it: Prima di utilizzare gli script è necessario installare questo pacchetto: ::

source: When launching the scripts, indicate the user name you want to import from SOGo: ::
es: Al iniciar los scripts, indique el nombre de usuario que desea importar desde SOGo: ::
it: Entrambi gli script vanno eseguiti indicando il nome utente di cui si vuole eseguire l’importazione da SOGo: :.

source: Where ``user`` can be a username or ``all``.
es: Donde ``usuario`` puede ser un nombre de usuario o ``todos``.
it: Dove ``user`` può essere un nome utente oppure ``all``.

source: **Examples**
es: **Ejemplos**
it: **Esempi**

source: To import all address books from SOGo: ::
es: Para importar todas las libretas de direcciones de SOGo: ::
it: Importare tutte le rubriche presenti su SOGo: ::

source: To import the calendar of user "foo": ::
es: Para importar el calendario del usuario "foo": ::
it: Importare il calendario dell’utente “foo”: ::

source: If the script is executed multiple times, both calendars and address books will be imported multiple times. Import of distribution lists and recurring events are not currently supported.
es: Si la secuencia de comandos se ejecuta varias veces, tanto los calendarios como las libretas de direcciones se importarán varias veces. Actualmente, no se admite la importación de listas de distribución y eventos recurrentes.
it: Se lo script viene eseguito più volte verranno importati più volte sia calendari che rubriche. Attualmente non è supportata l’importazione sia delle liste di distribuzione dalle rubriche che degli eventi ricorrenti dai calendari.

source: Importing from Outlook PST
es: Importación desde Outlook PST
it: Importazione da Outlook PST

source: You can import email, calendars and address books from an :index:`Outlook` :index:`PST` archive.
es: Puede importar correo electrónico, calendarios y libretas de direcciones desde un archivo :index:`Outlook` :index:`PST`.
it: E’ possibile importare email, calendari e rubriche da un archivio :index:`PST` :index:`Outlook` .

source: Before using followings scripts, you will need to install *libpst* package: ::
es: Antes de usar los scripts siguientes, necesitará instalar el paquete *libpst*: ::
it: Prima di utilizzare lo script installare il pacchetto *libpst*: ::

source: Mail
es: Correo

source: Initial script to import mail messages: :file:`/usr/share/webtop/doc/pst2webtop.sh`
es: Script inicial para importar mensajes de correo: :file:`/usr/share/webtop/doc/pst2webtop.sh`
it: Script per importare i messaggi di posta: :file:`/usr/share/webtop/doc/pst2webtop.sh`

source: To start the import, run the script specifying the PST file and the system user: ::
es: Para iniciar la importación, ejecute el script especificando el archivo PST y el usuario del sistema: ::
it: Per iniziare l'importazione eseguire lo script indicando il file PST e l’utente di sistema: ::

source: All mail messages will be imported. Contacts and calendars will be saved inside a temporary files for later import. The script will list all created temporary files.
es: Se importarán todos los mensajes de correo. Los contactos y los calendarios se guardarán dentro de los archivos temporales para su posterior importación. El script mostrará todos los archivos temporales creados.
it: Verranno importati tutti i messaggi di posta. Contatti e calendari verranno salvati all'interno di file temporanei per successiva importazione. Lo script elencherà tutti i file temporanei creati.

source: Contacts
es: Contactos
it: Contatti

source: Script for contacts import: :file:`/usr/share/webtop/doc/pst2webtop_card.php`.
es: Script para importar contactos: :file:`/usr/share/webtop/doc/pst2webtop_card.php`.
it: Script importazione Contatti: :file:`/usr/share/webtop/doc/pst2webtop_card.php`.

source: The script will use files generated from mail import phase: ::
es: El script utilizará los archivos generados desde la fase de importación de correo: ::
it: Lo script utilizzerà i file generati nella fase di importazione della posta

source: Let us assume that the pst2webtop.sh script has generated following output from mail import: ::
es: Supongamos que el script pst2webtop.sh ha generado la siguiente salida de la importación de correo:
it: Ipotizziamo che lo script precedente pst2webtop.sh abbia generato il seguente output a seguito dell'importazione delle mail: ::

source: To import the default address book (WebTop) of *foo* user: ::
es: Para importar la libreta de direcciones predeterminada (WebTop) de *foo usuario: ::
it: Per importare nella Rubrica predefinita (WebTop) dell’utente *foo*: ::

source: Calendars
es: Calendarios
it: Calendari

source: Script for calendars import: :file:`/usr/share/webtop/doc/pst2webtop_cal.php`
es: Script para importar calendarios: :file:`/usr/share/webtop/doc/pst2webtop_cal.php`
it: Script importazione Calendari: :file:`/usr/share/webtop/doc/pst2webtop_cal.php`

source: To import the default calendar (WebTop) of *foo* user: ::
es: Para importar el calendario predeterminado (WebTop) de *foo* usuario: ::
it: Per importare nel Calendario predefinito (WebTop) dell’utente *foo*: ::

source: The script will import all events using the timezone selected by the user inside WebTop, if set. Otherwise system timezone will be used.
es: El script importará todos los eventos utilizando la zona horaria seleccionada por el usuario dentro de WebTop, si se establece. De lo contrario se utilizará la zona horaria del sistema.
it: Lo script importa gli eventi utilizzando il fuso orario dall’utente WebTop, se configurato. Altrimenti verrà utilizzato il fuso orario del sistema.

source: Google and Dropbox integration
es: Integración de Google y Dropbox
it: Integrazione Google e Dropbox

source: Users can add their own Google Drive and Dropbox accounts inside WebTop. Before proceeding, the administrator must create a pair of API access credentials.
es: Los usuarios pueden agregar sus propias cuentas de Google Drive y Dropbox dentro de WebTop. Antes de continuar, el administrador debe crear un par de credenciales de acceso a la API.
it: Ogni utente può integrare i propri account Google Drive e Dropbox all’interno di WebTop. Prima di procedere, l’amministratore deve creare una coppia di credenziali per l’accesso alle API.

source: Google API
es: API de Google

source: Access https://console.developers.google.com/project and create a new project
es: Acceder a https://console.developers.google.com/project y crear un nuevo proyecto
it: Accedere a https://console.developers.google.com/project e creare un nuovo progetto

source: Create new credentials by selecting "OAuth 2.0 clientID" type and remember to compile "OAuth consent screen" section
es: Cree nuevas credenciales seleccionando el tipo "OAuth 2.0 clientID" y recuerde compilar la sección "Pantalla de consentimiento de OAuth"
it: Creare una nuova coppia di credenziali di tipo “OAuth 2.0 clientID” avendo cura di compilare la sezione “OAuth consent screen”

source: Insert new credentials (Client ID e Client Secret) inside WebTop configuration
es: Inserte nuevas credenciales (Client ID e Client Secret) dentro de la configuración de WebTop
it: Inserire la coppia di credenziali appena create (Client ID e Client Secret) nella configurazione di WebTop

source: From shell, access webtop database: ::
es: Desde shell, accede a la base de datos webtop: ::
it: Da shell accedere al database webtop: ::

source: Execute the queries, using the corresponding value in place of ``__value__`` variable: ::
es: Ejecute las consultas, utilizando el valor correspondiente en lugar de la variable ``__value__``: ::
it: Eseguire le query, sostituendo al campo ``__value__`` il valore corrispondente: ::

source: Dropbox API
es: API de Dropbox

source: Access https://www.dropbox.com/developers/apps and create a new app
es: Acceder a https://www.dropbox.com/developers/apps y crear una nueva aplicación
it: Accedere a https://www.dropbox.com/developers/apps e creare una nuova app

source: Insert the new credential key pair (App key e App secret) inside WebTop configuration
es: Inserte el nuevo par de claves de credencial (App key e App secret) dentro de la configuración de WebTop
it: Inserire la coppia di credenziali appena create (App key e App secret) nella configurazione di WebTop.

source: If you need to raise the user limit, please read the official Dropbox documentation.
es: Si necesita aumentar el límite de usuario, lea la documentación oficial de Dropbox.
it: Se si desidera cambiare il limite massimo di utenti, verificare la procedura corretta nella documentazione ufficiale di Dropbox.

source: The Enterprise version is already integrated with Google and Dropbox.
es: La versión Enterprise ya está integrada con Google y Dropbox.
it: La versione Enteprise è già integrata con Google e Dropbox.
